# 1․ Գրել ֆունկցիա, որը․
#    - որպես արգումենտ կընդունի շրջանագծի շառավիղը (r) և սեկտորի անկյունը (alpha) ռադիաններով արտահայտված,
#    - կհաշվի և կտպի համապատասխան շառավղով և անկյունով սեկտորի մակերեսը,
#    - բանաձևը՝ S = (pi * r ** 2) * alpha / 360, բանաձևի մեջ alpha-ն արտահայտված է աստիճաններով։

# def circ(r,alpha):
#     alpha = alpha * 180 / 3.14
#     s = (3.14 * r ** 2) * alpha / 360
#
#     print("սեկտորի մակեևեսը =",s)
#
# circ(3, 5)


# 2․ Գրել ֆունկցիա, որը․
#    - կստանա արգումենտ արաբական բնական թիվ (0-ից մեծ),
#    - կվերադրձնի այդ թիվը հռոմեական տեսքով,
#    հռոմեական թվերի համարժեքները՝ I-1, V-5, X-10, L-50, C-100, D-500, M-1000,
#    օրինակ՝ 15 -> XV,
#            72 -> LXXII,
#            9 -> IX:



def hrom_num(n):
    hrom = {'I':1,'V':5,'X':10,'L':50,'C':100,'D':500,'M':1000 }





# 3․ Գրել ֆունկցիա, որը․
#    - տրված բառերի list-ը կֆիլտրի այնպես, որ կթողի միայն ամենաերկար բառերը
#      (այսինքն՝ կգտնի ամենաերկար բառի երկարությունը և լիստում կթողնի միայն այդ երկարության բառերը),
#    օրինակ՝ input = ["aba", "aa", "z", "ad", "vcd", "aba"]
#            output = ["aba", "vcd", "aba"],


def filter(list):
    max_words = 0
    output = []
    for i in list:
        if len(i) > max_words:
            max_words = len(i)

    for w in list:
        if len(w) == max_words:
            output.append(w)
    print(output)

input = ["aba", "aa", "z", "ad", "vcd", "aba"]
filter(input)













